# FUHSD3 FINAL - Population Data

# Q0. Import the appropriate libraries

In [59]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Q1. Import the dataset
Import the appropriate csv file and set it equal to variable df. Display the first 5 rows of df.

In [60]:
df = pd.read_csv("population_final.csv")
df.head()

,Country Name,Country Code,Continent,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,...,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017
0,Aruba,ABW,Other,"Population, total",SP.POP.TOTL,54211.0,55438.0,56225.0,56695.0,57032.0,...,101353.0,101453.0,101669.0,102053.0,102577.0,103187.0,103795.0,104341.0,104822.0,NaN
1,Afghanistan,AFG,Asia,"Population, total",SP.POP.TOTL,8996351.0,9166764.0,9345868.0,9533954.0,9731361.0,...,27294031.0,28004331.0,28803167.0,29708599.0,30696958.0,31731688.0,32758020.0,33736494.0,34656032.0,NaN
2,Angola,AGO,Africa,"Population, total",SP.POP.TOTL,5643182.0,5753024.0,5866061.0,5980417.0,6093321.0,...,21759420.0,22549547.0,23369131.0,24218565.0,25096150.0,25998340.0,26920466.0,27859305.0,28813463.0,NaN
3,Albania,ALB,Europe,"Population, total",SP.POP.TOTL,1608800.0,1659800.0,1711319.0,1762621.0,1814135.0,...,2947314.0,2927519.0,2913021.0,2905195.0,2900401.0,2895092.0,2889104.0,2880703.0,2876101.0,NaN
4,Andorra,AND,Europe,"Population, total",SP.POP.TOTL,13411.0,14375.0,15370.0,16412.0,17469.0,...,83861.0,84462.0,84449.0,83751.0,82431.0,80788.0,79223.0,78014.0,77281.0,NaN

# Q2. Shape of df
Find the shape of df.
Set the number of rows equal to variable "rows" and the number of columns equal to variable "columns". Make this dynamic, do not just write in the numbers

In [61]:
#shape
df.shape

(264, 63)

In [71]:
#rows
rows=len(df)

In [72]:
#columns
columns=df.columns

# Q4. Nulls

Find the number of nulls in each column. Return answer as a series type.

In [73]:
df.isnull().sum()

Country Name    0
Country Code    0
Continent       0
1960            0
1961            0
1962            0
1963            0
1964            0
1965            0
1966            0
1967            0
1968            0
1969            0
1970            0
1971            0
1972            0
1973            0
1974            0
1975            0
1976            0
1977            0
1978            0
1979            0
1980            0
1981            0
1982            0
1983            0
1984            0
1985            0
1986            0
1987            0
1988            0
1989            0
1990            0
1991            0
1992            0
1993            0
1994            0
1995            0
1996            0
1997            0
1998            0
1999            0
2000            0
2001            0
2002            0
2003            0
2004            0
2005            0
2006            0
2007            0
2008            0
2009            0
2010            0
2011            0
2012            0
2013            0
2014            0
2015            0
2016            0
dtype: int64

Drop the column whose values are all null.

In [74]:
df=df.dropna(axis = 1, how="all")

Drop the rows which contain any nulls.

In [75]:
df=df.dropna(axis = 0, how="any")

What is the new shape of df?

In [76]:
df.shape

(258, 60)

# Q5. Drop columns
Turns out that there are some columns in your dataframe that you do not need and are taking up space. Drop the columns "Indicator Name" and "Indicator Code"

In [68]:
 df = df.drop("Indicator Name", axis = 1)
df = df.drop("Indicator Code", axis = 1)
df.shape

(258, 60)

What is the new shape of df?

In [77]:
df.shape

(258, 60)

# Q6. Subset Data Frame
Turns out that you only want to look at the data from 2000 to 2005. Subset your dataframe appropriately to include the Country Name, Code, Continent, and the appropriate years. Set that equal to variable name df2.

In [78]:
df2 = df[["Country Name", "Country Code", "Continent", "2000", "2001", "2002", "2003", "2004", "2005"]]
df2.tail()

,Country Name,Country Code,Continent,2000,2001,2002,2003,2004,2005
259,Kosovo,XKX,Other,1700000.0,1701154.0,1702310.0,1703466.0,1704622.0,1705780.0
260,"Yemen, Rep.",YEM,Other,17874725.0,18390135.0,18919179.0,19462086.0,20017068.0,20582927.0
261,South Africa,ZAF,Africa,44896856.0,45312937.0,45855483.0,46418194.0,47001701.0,47606670.0
262,Zambia,ZMB,Africa,10531221.0,10824125.0,11120409.0,11421984.0,11731746.0,12052156.0
263,Zimbabwe,ZWE,Africa,12222251.0,12366165.0,12500525.0,12633897.0,12777511.0,12940032.0

What is the shape of df2?

In [79]:
df2.shape

(258, 9)

# Q7. Data Types
Check the data types of the values within each column of df2.
Hint: use the info function

In [80]:
type(df2)

pandas.core.frame.DataFrame

In [82]:
for y in df.columns:
    if(agg[y].dtype.kind == 'f' or agg[y].dtype.kind == 'i'):
          treat_numeric(agg[y])
    else:
          treat_str(agg[y])

NameError: name 'agg' is not defined

# Q8. Change Data Types
Change the data type of your float types to integers.

Check data types again.

In [ ]:
"""YOUR ANSWER HERE"""

# Q9. Descriptive Statistics
Find the descriptive statistics of df2.

In [81]:
df2.describe()

,2000,2001,2002,2003,2004,2005
count,2.580000e+02,2.580000e+02,2.580000e+02,2.580000e+02,2.580000e+02,2.580000e+02
mean,2.482534e+08,2.516513e+08,2.550406e+08,2.584520e+08,2.618904e+08,2.653562e+08
std,7.868588e+08,7.972778e+08,8.076069e+08,8.179434e+08,8.283152e+08,8.387421e+08
min,9.420000e+03,9.512000e+03,9.635000e+03,9.767000e+03,9.894000e+03,1.002700e+04
25%,1.231302e+06,1.263572e+06,1.281758e+06,1.293340e+06,1.305488e+06,1.311394e+06
50%,8.341036e+06,8.579694e+06,8.742815e+06,8.884324e+06,8.980636e+06,9.077490e+06
75%,4.865098e+07,4.861148e+07,4.942744e+07,5.051561e+07,5.179629e+07,5.318426e+07
max,6.118075e+09,6.197638e+09,6.276824e+09,6.356260e+09,6.436347e+09,6.517021e+09

# Q10. Max Continent
Within df2, how many countries are there per continent?

Subset df2 to only display rows where the continent is "Other"

A lot of the values under the Other continent are not actually countries. Update your df2 to select everything except the rows where the Continent is "Other"

In [ ]:
"""YOUR ANSWER HERE"""

What is the new shape of df2?

In [ ]:
"""YOUR ANSWER HERE"""

# Q11. Visualize
Create a histogram for each year to visualize the distribution of the populations

In [ ]:
#2000
"""YOUR ANSWER HERE"""

In [ ]:
#2001
"""YOUR ANSWER HERE"""

In [ ]:
#2002
"""YOUR ANSWER HERE"""

In [ ]:
#2003
"""YOUR ANSWER HERE"""

In [ ]:
#2004
"""YOUR ANSWER HERE"""

In [ ]:
#2005
"""YOUR ANSWER HERE"""